DataProcessors/упРМДиспетчераГаража.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМДиспетчераГаража</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Гараж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГаражи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/упСтатусыПутевогоЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыПутевогоЛиста</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТранспортныеСредства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.упМоделиТС</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиОпределятьКонечныйОстатокТопливаПоДаннымДатчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиОпределятьКонечныйПробегПоДаннымДатчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПодбиратьВозвращениеВГаражВРейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПодбиратьГаражВРейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойОсновнойВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатчикУровняТоплива</Name>
					<Comment>Используется для автоматического заполнения путевого листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.упДатчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеЗоны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиГеографическихЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьФиксироватьДанныеОМестоположенииСМобильногоКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеПрисоединенныйФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредстваПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосадочныхМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетНеобходимыхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПакетыДокументовТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерерывМеждуРейсами</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФормаПутевогоЛиста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:EnumRef.упТипыПечатныхФормПутевогоЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьНаличиеУстановленныхТрекеровКромеМобильногоКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнаряженнаяМасса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственноеТранспортноеСредство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильЛиний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиЛиний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыКузововТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидГСМОсновной</Name>
					<Comment>Используется для автоматического заполнения путевого листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкологическийКласс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упЭкологическиеКлассыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гаражи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гараж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГаражи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГаражныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКлассыОпасныхГрузов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлассОпасности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьВидыГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемБака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/упРМДиспетчераГаража/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыОтбораНаСервере();
	
	// СтандартныеПодсистемы.Печать
	мсвОбъектов = Новый Массив;
	мсвОбъектов.Добавить(Метаданные.Документы.упПутевойЛист);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Вставить("Источники", мсвОбъектов);
	ПараметрыРазмещения.Вставить("КоманднаяПанель", Элементы.РейсыГруппаКомандаПечати);
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.Печать
	
	ИспользоватьДополнительныеОтчетыИОбработки = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки");
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	УстановитьПараметрыОтбораНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РейсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Рейсы.ТекущиеДанные;
	
	Если Поле.Имя = "РейсыТранспортноеСредство" Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекущиеДанные.ТранспортноеСредство) Тогда
			СтандартнаяОбработка = Ложь;
			сткПараметры = Новый Структура("Ключ",ТекущиеДанные.ТранспортноеСредство);
			ОткрытьФорму("Справочник.упТранспортныеСредства.Форма.ФормаЭлемента",сткПараметры);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "РейсыПутевойЛист" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьТекущийПутевойЛист();	
		
	ИначеЕсли Поле.Имя = "РейсыСсылка" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьТекущийРейс();		
		
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура РейсыПриАктивизацииСтроки(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ГаражПриИзменении(Элемент)
	УстановитьПараметрыОтбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ТипИсточника = ТипЗнч(Источник);
	ЭтоТипОбрабатывается = ТипИсточника = Тип("ДокументСсылка.упПутевойЛист") ИЛИ ТипИсточника = Тип("ДокументСсылка.упРейс");
	
	Если ЭтоТипОбрабатывается Тогда
		Элементы.Рейсы.Обновить();
		УстановитьДоступность();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЖурналУчетаПутевыхЛистов(Команда)
	
	ОткрытьФорму("Отчет.упЖурналУчетаДвиженияПутевыхЛистов.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПутевойЛист(Команда)
	ОткрытьТекущийПутевойЛист();	
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьПутевойЛист(Команда)
	
	мсвРейсы = Новый Массив;
	Для каждого текСтрока Из Элементы.Рейсы.ВыделенныеСтроки Цикл
		
		текСтрока = Элементы.Рейсы.ДанныеСтроки(текСтрока);
		
		Если текСтрока.СтатусПутевогоЛиста = ПредопределенноеЗначение("Перечисление.упСтатусыПутевогоЛиста.Новый") Тогда
			мсвРейсы.Добавить(текСтрока.Рейс);	
		КонецЕсли;
				
	КонецЦикла;
	
	Отказ = Ложь;
	мсвПутевойЛист = ВыдатьПутевыеЛистыНаСервере(мсвРейсы, Объект.Гараж, Отказ);
	
	Если НЕ Отказ Тогда
		Если мсвРейсы.Количество() = 1 И мсвПутевойЛист.Количество() > 0 Тогда
			ПараметрыФормы = Новый Структура("Ключ", мсвПутевойЛист[0]);
			ОткрытьФорму("Документ.упПутевойЛист.Форма.ФормаДокумента", ПараметрыФормы);	
		КонецЕсли;
		Для каждого текПутевойЛист Из мсвПутевойЛист Цикл
			Оповестить("СменаСтатуса", ,текПутевойЛист);	
		КонецЦикла;
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Произошла ошибка.'"),"e1cib/app/Обработка.ЖурналРегистрации","Подробности см. в журнале регистрации.", БиблиотекаКартинок.Ошибка32);			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьПутевогоЛиста(Команда)
	
	мсвПутевыхЛистов = Новый Массив;
	
	Для каждого Строка Из Элементы.Рейсы.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.Рейсы.ДанныеСтроки(Строка);
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ПутевойЛист) Тогда
			мсвПутевыхЛистов.Добавить(ДанныеСтроки.ПутевойЛист);
		КонецЕсли;
	КонецЦикла;

	мсвПечатныхФорм = ПечатныеФормПутевыхЛистовПоУмолчанию(мсвПутевыхЛистов);
	
	Для каждого ПечатнаяФорма Из мсвПечатныхФорм Цикл
		мсвСылок 					= ПечатнаяФорма.мсвПутевыхЛистов;
		ПечатнаяФормаПутевогоЛиста 	= ПечатнаяФорма.ПечатнаяФормаПутевогоЛиста;
		ИмяМакета 					= ПечатнаяФорма.ИмяМакета;
		ИмяОбъектаМетаданных = "Документ.упПутевойЛист";
		Если ТипЗнч(ПечатнаяФормаПутевогоЛиста) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") 
			И ИспользоватьДополнительныеОтчетыИОбработки Тогда
			//ПараметрыПечати = Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами",Истина);
			//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ИмяОбъектаМетаданных, ИмяМакета, мсвСылок, ЭтаФорма, ПараметрыПечати);
			ВыполняемаяКоманда = Новый Структура();
			ВыполняемаяКоманда.Вставить("Идентификатор",СтрЗаменить(ИмяМакета,"ВнешняяПечатнаяФорма.",""));
			ВыполняемаяКоманда.Вставить("Ссылка",ПечатнаяФормаПутевогоЛиста);
			ДополнительныеПараметры = Новый Структура("ВыполняемаяКоманда",ВыполняемаяКоманда);
			ДополнительныеПараметры.Вставить("Форма",ЭтаФорма);
			ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеПечатнойФормыЗавершение(мсвСылок,ДополнительныеПараметры);
		Иначе	
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ИмяОбъектаМетаданных, ИмяМакета, мсвСылок, ЭтаФорма); 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//// СтандартныеПодсистемы.Печать
//&НаКлиенте
//Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
//    УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Рейсы);
//КонецПроцедуры
//// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Рейсы);

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)

	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Рейсы, Результат);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Рейсы);

КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ОткрытьТекущийПутевойЛист()
	ПутевойЛист = Элементы.Рейсы.ТекущиеДанные.ПутевойЛист;
	Если ЗначениеЗаполнено(ПутевойЛист) Тогда
		сткПараметры = Новый Структура("Ключ", ПутевойЛист);
		ОткрытьФорму("Документ.упПутевойЛист.Форма.ФормаДокумента", сткПараметры);
	Иначе	
		ПоказатьОповещениеПользователя(НСтр("ru = 'Невозможно открыть путевой лист.'"),, НСтр("ru = 'По текущему рейсу путевой лист не сформирован.'"), БиблиотекаКартинок.Ошибка32);			
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущийРейс()
	Рейс = Элементы.Рейсы.ТекущиеДанные.Рейс;
	Если ЗначениеЗаполнено(Рейс) Тогда
		сткПараметры = Новый Структура("Ключ", Рейс);
		ОткрытьФорму("Документ.упРейс.Форма.ФормаДокумента", сткПараметры);
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если НЕ Элементы.Рейсы.ТекущиеДанные = Неопределено Тогда
		
		ТекущиеДанные 	= Элементы.Рейсы.ТекущиеДанные;
		ПутевойЛист 	= ТекущиеДанные.ПутевойЛист;
		Статус 			= ТекущиеДанные.СтатусПутевогоЛиста;
		
		Элементы.РейсыВыдатьПутевойЛист.Доступность 								= ЕстьДоступныеДляВыдачиПутевыеЛисты();
		Элементы.РейсыОбработкаупРМДиспетчераСкладаВернутьПутевойЛист.Доступность 	= Статус = ПредопределенноеЗначение("Перечисление.упСтатусыПутевогоЛиста.Выдан");
		Элементы.РейсыОбработкаупРМДиспетчераСкладаЗакрытьПутевойЛист.Доступность 	= Статус = ПредопределенноеЗначение("Перечисление.упСтатусыПутевогоЛиста.Возвращен");
		Элементы.РейсыОбработкаупРМДиспетчераСкладаЗаправитьТС.Доступность 			= Статус = ПредопределенноеЗначение("Перечисление.упСтатусыПутевогоЛиста.Новый") 
																								И ЗначениеЗаполнено(ПутевойЛист)
																						ИЛИ Статус = ПредопределенноеЗначение("Перечисление.упСтатусыПутевогоЛиста.Выдан");
		Элементы.РейсыОткрытьПутевойЛист.Доступность 								= ЗначениеЗаполнено(ПутевойЛист);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ЕстьДоступныеДляВыдачиПутевыеЛисты()
	
	текРезультат = Ложь;
	
	Для каждого КлючСтроки Из Элементы.Рейсы.ВыделенныеСтроки Цикл
		
		  текСтрока = Элементы.Рейсы.ДанныеСтроки(КлючСтроки);
		  
		  текРезультат = текСтрока.СтатусПутевогоЛиста = ПредопределенноеЗначение("Перечисление.упСтатусыПутевогоЛиста.Новый") ИЛИ текРезультат;
		  
		  Если текРезультат Тогда
		  		Прервать;
		  КонецЕсли;
		  		
	КонецЦикла;
	
	Возврат текРезультат;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыОтбораНаСервере()
	
	ТекущаяЗонаПогрузки = Неопределено;
	
	Если ПолучитьФункциональнуюОпцию("упКонтролироватьДоступностьГеографическихЗон") Тогда
		сткДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Гараж, Новый Структура("ЗонаПогрузки", "Адрес.ГеографическаяЗона"));
		ТекущаяЗонаПогрузки = сткДанные.ЗонаПогрузки;
	КонецЕсли;
	
	Если ТекущаяЗонаПогрузки = Неопределено Тогда
		ТекущаяЗонаПогрузки = ПредопределенноеЗначение("Справочник.упГеографическиеЗоны.ПустаяСсылка");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Рейсы, "ЗонаПогрузки", 	ТекущаяЗонаПогрузки);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Рейсы, "Гараж", 	Объект.Гараж);
	
КонецПроцедуры

&НаСервере
Функция ВыдатьПутевыеЛистыНаСервере(мсвРейсы, Гараж, Отказ)
	
	мсвПутевыеЛисты = Новый Массив;
	
	//АдресГаража = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Гараж, "Адрес");
		
	текПутевойЛист = упПутевойЛистУчетГСМ.ВыдатьПутевойЛистПоРейсам(мсвРейсы, Гараж, Отказ);	
	Если НЕ Отказ Тогда
		мсвПутевыеЛисты.Добавить(текПутевойЛист);
	КонецЕсли;
		
	Возврат мсвПутевыеЛисты;
	
КонецФункции

&НаСервере
Функция ПечатныеФормПутевыхЛистовПоУмолчанию(мсвПутевыхЛистов)
	
	мсвРезультат = упПутевойЛистУчетГСМ.ПечатныеФормПутевыхЛистовПоУмолчанию(мсвПутевыхЛистов);
			
	Возврат мсвРезультат;
	
КонецФункции


#КонецОбласти
